<template>
  <Card>
    <template #content style="width: 25rem; margin-bottom: 2em">
      <div v-if="prediction.label == 1">
        <h2>Значительный размер веществ, но судимости нет</h2>
        <p>
          Вероятность такая:
          <ul>
            <li>лишение свободы</li>
            <li>условное лишение свободы</li>
            <li>обязательные/исправительные работы/ограничение свободы/штраф</li>
            <li>судебный штраф</li>
            </ul>

        </p>
      </div>
      <div v-if="prediction.type == 2">
        <h2>Значительный размер веществ, но судимости нет</h2>
        <p>
          Возможное наказание: условное лишение свободы; штраф; обязательные или
          исправительные работы; ограничение свободы. Вероятность избежать
          лишения свободы — ___ процентов. Вероятность лишения свободы — ___
          процентов. Срок — ____ лет ____ месяцев. Возможное наказание: условное
          лишение свободы; штраф; обязательные или исправительные работы;
          ограничение свободы. Вероятность избежать лишения свободы — ___
          процентов. Вероятность лишения свободы — ___ процентов. Срок — ____
          лет ____ месяцев. Возможное наказание: условное лишение свободы;
          штраф; обязательные или исправительные работы; ограничение свободы.
        </p>
      </div>
      <div v-if="prediction.type == 3">
        <h2>Крупный размер изъятого вещества</h2>
        <p>
          Возможное наказание: условное лишение свободы; штраф; обязательные или
          исправительные работы; ограничение свободы. Вероятность избежать
          лишения свободы — ___ процентов. Вероятность лишения свободы — ___
          процентов. Срок — ____ лет ____ месяцев. Возможное наказание: условное
          лишение свободы; штраф; обязательные или исправительные работы;
          ограничение свободы. Вероятность избежать лишения свободы — ___
          процентов. Вероятность лишения свободы — ___ процентов. Срок — ____
          лет ____ месяцев. Возможное наказание: условное лишение свободы;
          штраф; обязательные или исправительные работы; ограничение свободы.
        </p>
      </div>
      <div v-if="prediction.type == 4">
        <h2>Особо крупный размер вещества</h2>
        <p>
          Возможное наказание: условное лишение свободы; штраф; обязательные или
          исправительные работы; ограничение свободы. Вероятность избежать
          лишения свободы — ___ процентов. Вероятность лишения свободы — ___
          процентов. Срок — ____ лет ____ месяцев. Возможное наказание: условное
          лишение свободы; штраф; обязательные или исправительные работы;
          ограничение свободы. Вероятность избежать лишения свободы — ___
          процентов. Вероятность лишения свободы — ___ процентов. Срок — ____
          лет ____ месяцев. Возможное наказание: условное лишение свободы;
          штраф; обязательные или исправительные работы; ограничение свободы.
        </p>
      </div>
      <div v-if="prediction.type == 5">
        <h2>Менее значительного размера</h2>
        <p>
          <b>Приобретение и хранение</b> такого количества наркотиков не
          считается уголовным преступлением (<a
            href="https://hand-help.ru/zakonodatelstvo/postanovleniya/sizesofdrugs2013"
            >по постановлению Правительства от 01.10.2012 г. № 1002</a
          >).
        </p>
        <p>
          Это административное правонарушение. Наказание — штраф до 4 до 5 тыс.
          руб. или арест на срок до 15 суток (статья 6.8 Кодекса об
          административных правонарушениях).
        </p>
        <p>
          Употребление наркотиков влечет такую же ответственность (по статье 6.9
          КоАП).
        </p>
        <p>
          «Предсказатель» еще не изучил постановления судов по этой категории
          дел.
        </p>
        <p>
          Согласно данным общероссийской судебной статистики, в ___ % дел
          назначается штраф, а в ____ % дел — арест. В ____ % суд обязует
          граждан пройти диагностику, профилактику и лечение в наркодиспансере
          по месту жительства.
        </p>
        <p>
          Рекомендация: Посмотреть консультации по данной категории дела в
          разделе «административные дела».
        </p>
      </div>
    </template>
    tem
  </Card>
</template>

<script>
// import Panel from "primevue/panel";
import Card from "primevue/card";

export default {
  components: { Card },
  props: { prediction: {}, display: Boolean },
  data() {
    return {
      displayPrediction: this.display,
    };
  },
  mounted() {
      console.log(this.prediction);
  }
  //   computed: {
  //     getType() {
  //       return this.prediction.type;
  //     },
  //   },
};
</script>

<style scoped>
.p-panel-header {
  font-size: 30px;
}
</style>
